OFMesh/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;


vertices
(
  (	0	0.013	0	)	//0
  (	0	0.0065	0	)	//1
  (	0	0.0065	-0.001	)	//2
  (	0	0.012961481	-0.001	)	//3
  (	0	-0.013	0	)	//4
  (	0	-0.0065	0	)	//5
  (	0	-0.0065	-0.001	)	//6
  (	0	-0.012961481	-0.001	)	//7
  (	0.072	0.025	0	)	//8
  (	0.072	0.012583333	0	)	//9
  (	0.072	0.012583333	-0.001	)	//10
  (	0.072	0.024979992	-0.001	)	//11
  (	0.072	-0.025	0	)	//12
  (	0.072	-0.012583333	0	)	//13
  (	0.072	-0.012583333	-0.001	)	//14
  (	0.072	-0.024979992	-0.001	)	//15
  (	0	0.0065	-0.0065	)	//16
  (	0	-0.0065	-0.0065	)	//17
  (	0.072	0.012583333	-0.012583333	)	//18
  (	0.072	-0.012583333	-0.012583333	)	//19
  (	0	0.009192388	-0.009192388	)	//20
  (	0	-0.009192388	-0.009192388	)	//21
  (	0.072	0.01767767	-0.01767767	)	//22
  (	0.072	-0.01767767	-0.01767767	)	//23
  (	0.074	0.025166667	0	)	//24
  (	0.074	0.012583333	0	)	//25
  (	0.074	-0.012583333	0	)	//26
  (	0.074	-0.025166667	0	)	//27
  (	0.074	0.025146791	-0.001	)	//28
  (	0.074	0.012583333	-0.001	)	//29
  (	0.074	-0.012583333	-0.001	)	//30
  (	0.074	-0.025146791	-0.001	)	//31
  (	0.074	0.017795521	-0.017795521	)	//32
  (	0.074	-0.017795521	-0.017795521	)	//33
  (	0.074	0.012583333	-0.012583333	)	//34
  (	0.074	-0.012583333	-0.012583333	)	//35
  (	0.09	0.028	0	)	//36
  (	0.09	0.014	0	)	//37
  (	0.09	-0.014	0	)	//38
  (	0.09	-0.028	0	)	//39
  (	0.09	0.027977591	-0.00112	)	//40
  (	0.09	0.014	-0.00112	)	//41
  (	0.09	-0.014	-0.00112	)	//42
  (	0.09	-0.027977591	-0.00112	)	//43
  (	0.09	0.014	-0.014	)	//44
  (	0.09	-0.014	-0.014	)	//45
  (	0.09	0.01979899	-0.01979899	)	//46
  (	0.09	-0.01979899	-0.01979899	)	//47
  (	2.25	0.52	0	)	//48
  (	2.25	0.26	0	)	//49
  (	2.25	-0.26	0	)	//50
  (	2.25	-0.52	0	)	//51
  (	2.25	0.51958933	-0.020662252	)	//52
  (	2.25	0.26	-0.020662252	)	//53
  (	2.25	-0.26	-0.020662252	)	//54
  (	2.25	-0.51958933	-0.020662252	)	//55
  (	2.25	0.26	-0.26	)	//56
  (	2.25	-0.26	-0.26	)	//57
  (	2.25	0.367695526	-0.367695526	)	//58
  (	2.25	-0.367695526	-0.367695526	)	//59
  (	0.072	0.0255	0	)	//60
  (	0.074	0.0255	0	)	//61
  (	0.072	0.0255	-0.001	)	//62
  (	0.074	0.0255	-0.001	)	//63
  (	-2.25	0.52	0	)	//64
  (	-2.25	0.26	0	)	//65
  (	-2.25	-0.26	0	)	//66
  (	-2.25	-0.52	0	)	//67
  (	-2.25	0.51958933	-0.020662252	)	//68
  (	-2.25	0.26	-0.020662252	)	//69
  (	-2.25	-0.26	-0.020662252	)	//70
  (	-2.25	-0.51958933	-0.020662252	)	//71
  (	-2.25	0.26	-0.26	)	//72
  (	-2.25	-0.26	-0.26	)	//73
  (	-2.25	0.367695526	-0.367695526	)	//74
  (	-2.25	-0.367695526	-0.367695526	)	//75
);

blocks
(
  hex	(	1	9	8	0	2	10	11	3	)	(	400	6	6	)	simpleGrading (	1	1	1	)	//0
	hex	(	5	13	9	1	6	14	10	2	)	(	400	10	6	)	simpleGrading (	1	1	1	)	//1
	hex	(	4	12	13	5	7	15	14	6	)	(	400	6	6	)	simpleGrading (	1	1	1	)	//2
	hex	(	6	14	10	2	17	19	18	16	)	(	400	10	6	)	simpleGrading (	1	1	1	)	//3
	hex	(	2	10	11	3	16	18	22	20	)	(	400	6	6	)	simpleGrading (	1	1	1	)	//4
	hex	(	17	19	18	16	21	23	22	20	)	(	400	10	6	)	simpleGrading (	1	1	1	)	//5
	hex	(	7	15	14	6	21	23	19	17	)	(	400	6	6	)	simpleGrading (	1	1	1	)	//6
	hex	(	9	25	24	8	10	29	28	11	)	(	10	6	6	)	simpleGrading (	1	1	1	)	//7
	hex	(	10	29	28	11	18	34	32	22	)	(	10	6	6	)	simpleGrading (	1	1	1	)	//8
	hex	(	13	26	25	9	14	30	29	10	)	(	10	10	6	)	simpleGrading (	1	1	1	)	//9
	hex	(	12	27	26	13	15	31	30	14	)	(	10	6	6	)	simpleGrading (	1	1	1	)	//10
	hex	(	14	30	29	10	19	35	34	18	)	(	10	10	6	)	simpleGrading (	1	1	1	)	//11
	hex	(	15	31	30	14	23	33	35	19	)	(	10	6	6	)	simpleGrading (	1	1	1	)	//12
	hex	(	19	35	34	18	23	33	32	22	)	(	10	10	6	)	simpleGrading (	1	1	1	)	//13
	hex	(	25	37	36	24	29	41	40	28	)	(	100	6	6	)	simpleGrading (	1	1	1	)	//14
	hex	(	29	41	40	28	34	44	46	32	)	(	100	6	6	)	simpleGrading (	1	1	1	)	//15
	hex	(	26	38	37	25	30	42	41	29	)	(	100	10	6	)	simpleGrading (	1	1	1	)	//16
	hex	(	27	39	38	26	31	43	42	30	)	(	100	6	6	)	simpleGrading (	1	1	1	)	//17
	hex	(	31	43	42	30	33	47	45	35	)	(	100	6	6	)	simpleGrading (	1	1	1	)	//18
	hex	(	30	42	41	29	35	45	44	34	)	(	100	10	6	)	simpleGrading (	1	1	1	)	//19
	hex	(	35	45	44	34	33	47	46	32	)	(	100	10	6	)	simpleGrading (	1	1	1	)	//20
	hex	(	37	49	48	36	41	53	52	40	)	(	10	6	6	)	simpleGrading (	1000	1	1	)	//21
	hex	(	38	50	49	37	42	54	53	41	)	(	10	10	6	)	simpleGrading (	1000	1	1	)	//22
	hex	(	39	51	50	38	43	55	54	42	)	(	10	6	6	)	simpleGrading (	1000	1	1	)	//23
	hex	(	41	53	52	40	44	56	58	46	)	(	10	6	6	)	simpleGrading (	1000	1	1	)	//24
	hex	(	42	54	53	41	45	57	56	44	)	(	10	10	6	)	simpleGrading (	1000	1	1	)	//25
	hex	(	43	55	54	42	47	59	57	45	)	(	10	6	6	)	simpleGrading (	1000	1	1	)	//26
	hex	(	45	57	56	44	47	59	58	46	)	(	10	10	6	)	simpleGrading (	1000	1	1	)	//27
	hex	(	8	24	61	60	11	28	63	62	)	(	10	10	6	)	simpleGrading (	1	10	1	)	//28
	hex	(	65	1	0	64	69	2	3	68	)	(	10	6	6	)	simpleGrading (	0.001	1	1	)	//29
	hex	(	66	5	1	65	70	6	2	69	)	(	10	10	6	)	simpleGrading (	0.001	1	1	)	//30
	hex	(	67	4	5	66	71	7	6	70	)	(	10	6	6	)	simpleGrading (	0.001	1	1	)	//31
	hex	(	69	2	3	68	72	16	20	74	)	(	10	6	6	)	simpleGrading (	0.001	1	1	)	//32
	hex	(	70	6	2	69	73	17	16	72	)	(	10	10	6	)	simpleGrading (	0.001	1	1	)	//33
	hex	(	71	7	6	70	75	21	17	73	)	(	10	6	6	)	simpleGrading (	0.001	1	1	)	//34
	hex	(	73	17	16	72	75	21	20	74	)	(	10	10	6	)	simpleGrading (	0.001	1	1	)	//35

);

edges
(
  arc 	74	68	(	-2.25	0.48641546	-0.183847763	)
  arc 	75	74	(	-2.25	0	-0.52	)
  arc 	71	75	(	-2.25	-0.48641546	-0.183847763	)
  arc 	67	71	(	-2.25	-0.519615242	-0.02	)
  arc 	64	68	(	-2.25	0.519615242	-0.02	)
  arc 	20	3	(	0	0.012160387	-0.004596194	)
  arc 	21	20	(	0	0	-0.013	)
  arc 	21	7	(	0	-0.012160387	-0.004596194	)
  arc 	7	4	(	0	-0.012990381	-0.0005	)
  arc 	0	3	(	0	0.012990381	-0.0005	)
  arc 	22	11	(	0.072	0.023385359	-0.008838835	)
  arc 	23	22	(	0.072	0	-0.025	)
  arc 	23	15	(	0.072	-0.023385359	-0.008838835	)
  arc 	18	12	(	0.072	-0.024994999	-0.0005	)
  arc 	8	11	(	0.072	0.024994999	-0.0005	)
  arc 	32	28	(	0.074	0.023541261	-0.00889776	)
  arc 	33	32	(	0.074	0	-0.025166667	)
  arc 	33	31	(	0.074	-0.023541261	-0.00889776	)
  arc 	31	27	(	0.074	-0.025161699	-0.0005	)
  arc 	28	24	(	0.074	0.025161699	-0.0005	)
  arc 	46	40	(	0.09	0.026191602	-0.009899495	)
  arc 	47	46	(	0.09	0	-0.028	)
  arc 	47	43	(	0.09	-0.026191602	-0.009899495	)
  arc 	43	39	(	0.09	-0.027994399	-0.00056	)
  arc 	40	36	(	0.09	0.027994399	-0.00056	)
  arc 	58	52	(	2.25	0.48641546	-0.183847763	)
  arc 	59	58	(	2.25	0	-0.52	)
  arc 	59	55	(	2.25	-0.48641546	-0.183847763	)
  arc 	55	51	(	2.25	-0.51989599	-0.0104	)
  arc 	52	48	(	2.25	0.51989599	-0.0104	)
);

boundary
(
 inlet
    {
        type patch;
        faces
        (
   (64 68 69 65)
    (68 74 72 69)
    (74 75 73 72)
    (69 72 73 70)
    (65 69 70 66)
    (70 73 75 71)
(66 70 71 67)
          );
      }

  outlet
     {
            type patch;
            faces
            (
  (48 49 53 52)
(49 50 54 53)
(50 51 55 54)
(52 53 56 58)
(56 57 59 58)
(57 54 55 59)
(53 56 57 54)
              );
          }

 injection
    {
        type patch;
        faces
        (
 (63 61 60 62)
          );
      }

walls
{
 type wall;
 faces
  (
(64 0 3 68)
(68 3 20 74)
(74 20 21 75)
(75 21 7 71)
(71 7 4 67)
(0 8 11 3)
(3 11 22 20)
(20 22 23 21)
(21 23 15 7)
(7 15 12 4)
(24 36 40 28)
(28 40 46 32)
(32 46 47 33)
(33 47 43 31)
(31 43 39 27)
(36 48 52 40)
(40 52 58 46)
(46 58 59 47)
(47 59 55 43)
(43 55 51 39)
(60 62 11 8)
(62 63 28 11)
(63 61 24 28)
);
 }

symmetry
{
type symmetryPlane;
faces
(
(64 65 1 0)
(65 66 5 1)
(66 67 4 5)
(0 1 9 8)
(1 5 13 9)
(5 4 12 13)
(8 9 25 24)
(9 13 26 25)
(13 12 27 26)
(24 25 37 36)
(25 26 38 37)
(26 27 39 38)
(36  37 49 48)
(37 38 50 49)
(38 39 51 50)
);
 }

);

mergePatchPairs
(
);

// ************************************************************************* //
/*   hex ( 1 9 8 0 2 10 11 3) ( 10 5 1) simpleGrading ( 1 1 1)
   hex (5 13 9 1 6 14 10 2) (10 5 1) simpleGrading (1 1 1)
   hex (4 12 13 5 7 15  14 6) (10 5 1) simpleGrading (1 1 1)
   hex (6 14 10 2 17 19 18 16) (10 5 1) simpleGrading (1 1 1)
 hex (2 10 11 3 16 18 22 20) (10 5 1) simpleGrading (1 1 1)
 hex (17 19 18 16 21 23 22 20) (10 5 5) simpleGrading (1 1 1)
 hex (7 15 14 6 21 23 19 17) (10 5 1) simpleGrading (1 1 1)

 hex (9 25 24 8 10 29 28 11) (10 5 1) simpleGrading (1 1 1)
 hex (10 29 28 11 18 34 32 22) (10 5 1) simpleGrading (1 1 1)
 hex (13 26 25 9 14 30 29 10) (10 5 1) simpleGrading (1 1 1)
 hex (12 27 26 13 15 31 30 14) (10 5 1) simpleGrading (1 1 1)
   hex (14 30 29 10 19 35 34 18) (10 5 1) simpleGrading (1 1 1)
   hex (15 31 30 14 23 33 35 19) (10 5 1) simpleGrading (1 1 1)
   hex (19 35 34 18 23 33 32 22) (10 5 5) simpleGrading (1 1 1)

   hex (25 37 36 24 29 41 40 28) (10 5 1) simpleGrading (1 1 1)
  hex (29 41 40 28 34 44 46 32) (10 5 1) simpleGrading (1 1 1)
   hex (26 38 37 25 30 42 41 29) (10 5 1) simpleGrading (1 1 1)
   hex (27 39 38 26 31 43 42 30) (10 5 1) simpleGrading (1 1 1)
   hex (31 43 42 30 33 47 45 35) (10 5 1) simpleGrading (1 1 1)
   hex (30 42 41 29 35 45 44 34) (10 5 1) simpleGrading (1 1 1)
   hex (35 45 44 34 33 47 46 32) (10 5 5) simpleGrading (1 1 1)

   hex (37 49 48 36 41 53 52 40) (10 5 1) simpleGrading (1 1 1)
   hex (38 50 49 37 42 54 53 41) (10 5 1) simpleGrading (1 1 1)
   hex (39 51 50 38 43 55 54 42) (10 5 1) simpleGrading (1 1 1)
   hex (41 53 52 40 44 56 58 46) (10 5 1) simpleGrading (1 1 1)
   hex (42 54 53 41 45 57 56 44) (10 5 1) simpleGrading (1 1 1)
   hex (43 55 54 42 47 59 57 45) (10 5 1) simpleGrading (1 1 1)
   hex (45 57 56 44 47 59 58 46) (10 5 5) simpleGrading (1 1 1)
   hex (8 24 61 60 11 28 63 62) (10 5 1) simpleGrading (1 1 1)

   hex (65 1 0 64 69 2 3 68) (10 5 1) simpleGrading (1 1 1)
hex (66 5 1 65 73 6 2 69) (10 5 1) simpleGrading (1 1 1)
hex (67 4 5 66 71 7 6 70) (10 5 1) simpleGrading (1 1 1)
hex (69 2 3 68 72 16 20 74) (10 5 1) simpleGrading (1 1 1)
hex (70 6 2 69 73 17 16 72) (10 5 1) simpleGrading (1 1 1)
hex (71 7 6 70 75 21 17 73) (10 5 1) simpleGrading (1 1 1)
hex (73 17 16 72 75 21 20 74) (10 5 5) simpleGrading (1 1 1)*/
